bpel.samples/resources/BluePrint4/BluePrint4Application/test/poRequestConfirm/Input1.xml

<soapenv:Envelope xmlns="http://manufacturing.org/xsd/purchase" 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <sendPurchaseOrder>
      <purchaseOrder>
        <purchaseOrder xmlns="http://manufacturing.org/xsd/purchase">
          <orderId>00001236</orderId>
	      <customerId>999666333</customerId>
	      <orderDescription>OrderVal_Any_Description</orderDescription>
	      <price></price>
        </purchaseOrder>
      </purchaseOrder>
    </sendPurchaseOrder>
  </soapenv:Body>
</soapenv:Envelope>
