bpel.samples/resources/BluePrint3/BluePrint3Application/test/poserviceFault/Input.xml

<soapenv:Envelope xmlns="http://manufacturing.org/xsd/purchase" 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <sendPurchaseOrder>
      <purchaseOrder>
        <purchaseOrder xmlns="http://manufacturing.org/xsd/purchase">
          <orderId>00012342</orderId>
          <customerId>9876</customerId>
          <orderDescription>ThrowPOServiceFault_Val_Any_Description</orderDescription>
          <price></price>
        </purchaseOrder>
      </purchaseOrder>
    </sendPurchaseOrder>
  </soapenv:Body>
</soapenv:Envelope>