tests/org.jboss.tools.bpel.ui.bot.test/messages/BluePrint3/BluePrint3_request_1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pur="http://manufacturing.org/xsd/purchase">
   <soapenv:Header/>
   <soapenv:Body>
      <pur:purchaseOrder>
         <pur:orderId>123</pur:orderId>
         <pur:customerId>456</pur:customerId>
         <pur:orderDescription>OrderInvalid: Attempt to purchase an out of stock item</pur:orderDescription>
         <pur:price>0</pur:price>
      </pur:purchaseOrder>
   </soapenv:Body>
</soapenv:Envelope>